// Библиотека должна обладать следующими методами:
// - поиск минимального элемента в переданном массиве;
// - поиск максимально элемента в переданном массиве;
// - расчет среднего арифметического значения элементов переданного массива;
// - создание копии (клонирование) переданного массива.
;(function() {

    function Mean() {
        var sum = 0;
        for (var i = 0; i < arr.length; i++) {
            sum = (sum + arr[i]) / arr.length;
        }
        return sum;
    }

    Math.min(arr);

    Math.max(arr);
}());
