'use strict'
/* Напишите функцию (), которая в зависимости от переданных в нее целочисленных аргументов "количество дней", будет выводить слово "день" в нужно форме ("если передали - 1, то 1 день", "если передали - 3, то 3 дня" и т.д).
 */
/*

Написать функцию подсчета суммы от n до m
function summ(n, m, d = m - n) {
    return ((n * 2 + d * (m - n)) / 2) * m
}
console.log(summ(prompt("N"), prompt('M')));

*/


/* Написать функцию factorial(n), которая возвращает факториал числа n, использовать рекурсию! */
/* Написать функцию, которая возвращает новую функцию, которая увеличивает/уменьшает переданное число на указанный при карировании шаг.  */
/* Сделайте функцию, каждый вызов который будет генерировать случайные числа от 1 до 100, но так, чтобы они не повторялись, пока не будут перебраны все числа из этого промежутка. Решите задачу через замыкания - в замыкании должен хранится массив чисел, которые уже были сгенерированы функцией. */
