// Задача №2
// Используя смешанное наследование:
// Создать шаблон объектов «Человек».
// Свойства «Имя», «Возраст», «Пол», «Интересы».
// Метод преобразования к строке вида: «Человек:
// Иван. Возраст: 25 лет. Пол: м. Интересы:
// музыка, программирование.»
// Создать шаблон объектов «Студент».
// Свойства от наследованные от шаблона объектов
// «Человек» и добавить «Институт».
// Переопределить метод преобразования к строке вида:
// «Студент: Иван. Возраст: 25 лет. Пол: м. Интересы:
// музыка, программирование. Обучается в ИТМО.»
