// Задача№2
// Создать объект «Товар» включающий:
// - свойства, такие как фото, артикул, описание и т.п.;
// - метод, которому при вызове передается id пустого div элемента и в этот html элемент данный
// метод создаст и внесёт все необходимые html элементы, стили, и содержание для отображения
// всей информации хранящихся в свойствах объекта о данном товаре. Дизайн оформления информации
// в html о товаре – это ваше творчество.
var product = {
    Weight: '9.6 ounces',
    'Manufacturer': 'Intel'
};
